
## Plan Result (terraform/env)

[CI link](https://github.com/team-all-in/all-in/actions/runs/10860329007)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_apprunner_service.all_in_api


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_apprunner_service.all_in_api will be created
  + resource "aws_apprunner_service" "all_in_api" {
      + arn                            = (known after apply)
      + auto_scaling_configuration_arn = (known after apply)
      + id                             = (known after apply)
      + service_id                     = (known after apply)
      + service_name                   = "all_in"
      + service_url                    = (known after apply)
      + status                         = (known after apply)
      + tags                           = {
          + "Name" = "all-in-apprunner-service"
        }
      + tags_all                       = {
          + "Name" = "all-in-apprunner-service"
        }

      + source_configuration {
          + auto_deployments_enabled = true

          + image_repository {
              + image_identifier      = "451153100141.dkr.ecr.ap-northeast-1.amazonaws.com/all_in_api:latest"
              + image_repository_type = "ECR"

              + image_configuration {
                  + port = "8000"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":56,"Program":"tfcmt","SHA1":"a365b272c7481e94b151e5360b0052553949a63b","Target":"terraform/env","Vars":{},"WorkflowName":"pull_request_target"} -->